// Задача1. Задайте значения M и N. Напишите программу,
// которая выведет все натуральные числа
// в промежутке от M до N.

// void FromToMandN (int m, int n)
// {
//     if (m>n)
//     {
//         FromToMandN(m-1,n);
//         System.Console.Write(m + " ");
//     }
//     else if (n>m)
//     {
//         FromToMandN(n-1,m);
//         System.Console.Write(n + " ");
//     }
//     else System.Console.Write(m + " ");
// }

// FromToMandN(6,2);
